#ifndef _FLASH_H
#define _FLASH_H
//==============================================================================
//文件名称：Flash.h
//功能概要：K60 Flash擦除/写入底层驱动程序头文件
//==============================================================================
#include "common.h"

//K60N512包含512K的程序Flash
//512K的程序Flash分为256个扇区，每个扇区2K大小
//sector（2K）为擦除最小单位
//长字（32b）为写的最小单位

//Flash控制器宏定义,内部使用 
#define CCIF    (1<<7)
#define ACCERR  (1<<5)
#define FPVIOL  (1<<4)
#define MGSTAT0 (1<<0)

//Flash命令宏定义,内部使用
#define RD1BLK    0x00   //读整块Flash
#define RD1SEC    0x01   //读整个扇区
#define PGMCHK    0x02   //写入检查
#define RDRSRC    0x03   //读目标数据
#define PGM4      0x06   //写入长字
#define ERSBLK    0x08   //擦除整块Flash
#define ERSSCR    0x09   //擦除Flash扇区
#define PGMSEC    0x0B   //写入扇区
#define RD1ALL    0x40   //读所有的块
#define RDONCE    0x41   //只读一次
#define PGMONCE   0x43   //只写一次
#define ERSALL    0x44   //擦除所有块
#define VFYKEY    0x45   //验证后门访问钥匙
#define PGMPART   0x80   //写入分区
#define SETRAM    0x81   //设定FlexRAM功能

//==============================================================================
//函数名称：FlashInit
//函数返回：无
//参数说明：无
//功能概要：初始化Flash模块
//==============================================================================
void FlashInit();

//==============================================================================
//函数名称：FlashEraseSector
//函数返回：函数执行执行状态：0=正常；非0=异常。
//参数说明：sectorNo：扇区号（K60N512实际使用0~255）
//功能概要：擦除指定flash扇区
//==============================================================================
uint8 FlashEraseSector(uint16 sectorNo);

//==============================================================================
//函数名称：FlashWrite
//函数返回：函数执行状态：0=正常；非0=异常。
//参数说明：sectNo：目标扇区号 （K60N512实际使用0~255）
//          offset:写入扇区内部偏移地址（0~2043）
//          cnt：写入字节数目（0~2043）
//          buf：源数据缓冲区首地址
//功能概要：flash写入操作
//==============================================================================
uint8 FlashWrite(uint16 sectNo,uint16 offset,uint16 cnt,uint8 buf[]);

#endif