#ifndef _KEYSCAN_H_
#define _KEYSCAN_H_

//1.头文件
#include "common.h"
#include "gpio.h"

//2.宏定义
//#define SW  1      
//#define BO  0       

//全局变量申明

extern uint8 BO_num[5];   //拨码开关状态记录数组
extern uint8 KP_flage;
extern uint8 SW_num;



//3.函数声明
//------------------------------------------------------------------------------
//函数名：KPInit
//功  能：键盘初始化函数
//参  数：无
//返  回：无
//说  明：
//------------------------------------------------------------------------------
void KPInit(void);

//------------------------------------------------------------------------------
//函数名：KPScan
//功  能：键盘扫描函数
//参  数：输入：SW：按键开关1,2,3,4,5  BO：拨码开关1,2,3,4  
//返  回：按键的值
//说  明：
//------------------------------------------------------------------------------

uint8 KPScan(void);


//----------------------------
//函数名：DelayMs
//功  能：ms延时程序
//参  数：延时长度time_cnt
//返  回：无
//说  明：延时程序，输入1代表1ms
//备  注：
//------------------------------------------------------------------------------
void DelayMs(int32 time_cnt);

//------------------------------------------------------------------------------
//函数名：DelayUs
//功  能：us延时程序
//参  数：延时长度time_cnt
//返  回：无
//说  明：延时程序，输入1代表1us
//备  注：
//------------------------------------------------------------------------------
void DelayUs(int32 time_cnt);

void SwitchControl(void);


#endif